stm32LLD/uart/src/uart.c
            // Check if request for swapping pins
            if ( true == p_uart_cfg->swap_txrx )
            {
                g_uart[uart_ch].handle.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_SWAP_INIT;
                g_uart[uart_ch].handle.AdvancedInit.Swap = UART_ADVFEATURE_SWAP_ENABLE;
            }
            else
            {
                g_uart[uart_ch].handle.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
            }

            // Init uart
            if ( HAL_OK != HAL_UART_Init( &g_uart[uart_ch].handle ))
            {
                status = eUART_ERROR;
            }

            // Init success
            if ( eUART_OK == status )
            {
                // Enable reception buffer not empty interrupt
                __HAL_UART_ENABLE_IT( &g_uart[uart_ch].handle, UART_IT_RXNE );

                // Error interrupt (frame error, noise error, overrun error)
                 __HAL_UART_ENABLE_IT( &g_uart[uart_ch].handle, UART_IT_ERR );

                // Setup UART interrupt priority and enable it
                NVIC_SetPriority( p_uart_cfg->irq_num, p_uart_cfg->irq_prio );
                NVIC_EnableIRQ( p_uart_cfg->irq_num );

                // Enable UART
                __HAL_UART_ENABLE( &g_uart[uart_ch].handle );

                // Init success
                g_uart[uart_ch].is_init = true;
            }
        }
    }
    else
    {
        status = eUART_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        De-Initialize UART
*
* @param[in]    uart_ch     - UART communication channel
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
uart_status_t uart_deinit(const uart_ch_t uart_ch)
{
    uart_status_t status = eUART_OK;

    UART_ASSERT( uart_ch < eUART_CH_NUM_OF );

    if ( uart_ch < eUART_CH_NUM_OF )
    {
        if  ( true == g_uart[uart_ch].is_init )
        {
            // Get UART configurations
            const uart_cfg_t * p_uart_cfg = uart_cfg_get_config( uart_ch );

            // De-init UART
            if ( HAL_OK != HAL_UART_DeInit( &g_uart[uart_ch].handle ))
            {
                status = eUART_ERROR;
            }

            // Disable reception buffer not empty interrupt
            __HAL_UART_DISABLE_IT( &g_uart[uart_ch].handle, UART_IT_RXNE );

            // Disable interrupt (frame error, noise error, overrun error)
             __HAL_UART_DISABLE_IT( &g_uart[uart_ch].handle, UART_IT_ERR );

            // De-init gpios
            uart_deinit_gpio( &( p_uart_cfg->tx_pin ));
            uart_deinit_gpio( &( p_uart_cfg->rx_pin ));

            // Disable clock
            uart_disable_clock( p_uart_cfg->p_instance );

            // De-Init success
            if ( eUART_OK == status )
            {
                g_uart[uart_ch].is_init = false;
            }
        }
    }
    else
    {
        status = eUART_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Get UART initialization flag
*
* @param[in]    uart_ch     - UART communication channel
* @param[out]   p_is_init   - Pointer to init flag
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
uart_status_t uart_is_init(const uart_ch_t uart_ch, bool * const p_is_init)
{
    uart_status_t status = eUART_OK;

    UART_ASSERT( uart_ch < eUART_CH_NUM_OF );
    UART_ASSERT( NULL != p_is_init );

    if (    ( uart_ch < eUART_CH_NUM_OF )
        &&  ( NULL != p_is_init ))
    {
        *p_is_init = g_uart[uart_ch].is_init;
    }
    else
    {
        status = eUART_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Transmit data over UART
*
* @note     This function is blocking!
*
* @note     When ".bits_per_frame = UART_WORDLENGTH_9B" the send data is handles as a set of uint16_t!
*           Size must indicate the number of uin16_t provided through "p_data"!
*
* @param[in]    uart_ch     - UART communication channel
* @param[in]    p_data      - Pointer to data to send
* @param[in]    size        - Size of data to send in bytes
* @param[in]    timeout     - Timeout in miliseconds
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
uart_status_t uart_transmit(const uart_ch_t uart_ch, const uint8_t * const p_data, const uint32_t size, const uint32_t timeout)
{
    uart_status_t status = eUART_OK;

    UART_ASSERT( uart_ch < eUART_CH_NUM_OF );
    UART_ASSERT( true == g_uart[uart_ch].is_init );
    UART_ASSERT( NULL != p_data );
    UART_ASSERT( size <= UART_CFG_MTU );

    if ( uart_ch < eUART_CH_NUM_OF )
    {
        if  (   ( true == g_uart[uart_ch].is_init )
            &&  ( NULL != p_data )
            &&  ( size <= UART_CFG_MTU ))
        {
            if ( HAL_OK != HAL_UART_Transmit( &g_uart[uart_ch].handle, p_data, size, timeout ))
            {
                status = eUART_ERROR;
            }
        }
        else
        {
            status = eUART_ERROR;
        }
    }
    else
    {
        status = eUART_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/*!
* @brief        Received data over UART
*
* @note     This function is blocking!
*
* @note     If timeout = 0, then this function is effectively non-blocking and
*           it will return "ERROR_TIMEOUT"!
*
* @note     When ".bits_per_frame = UART_WORDLENGTH_9B" the send data is handles as a set of uint16_t!
*           Size must indicate the number of uin16_t provided through "p_data"!
*
* @param[in]    uart_ch     - UART communication channel
* @param[out]   p_data      - Pointer to data to send
* @param[in]    size        - Amount of data bytes to be received
* @param[in]    timeout     - Timeout in miliseconds
* @return       status      - Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
uart_status_t uart_receive(const uart_ch_t uart_ch, uint8_t * const p_data, const uint32_t size, const uint32_t timeout)
{
    uart_status_t   status  = eUART_OK;
    uint32_t        rx_cnt  = 0;

    UART_ASSERT( size > 0U );

